NextFOAM-2405/tutorials/verificationAndValidation/turbulenceModels/planeChannel/setups.orig/common/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-12;
        relTol          0;
        minIter         3;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
        minIter         3;
    }

    "(k|omega|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
        minIter         3;
    }

    "(epsilon|phit)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
        minIter         3;
    }

    f
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
        minIter         3;
    }

    R
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
        minIter         3;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent          yes;
    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    equations
    {
        U               0.7;
        k               0.5;
        omega           0.5;
        nuTilda         0.5;
        epsilon         0.5;
        "(phit|f)"      0.5;
        R               0.4;
    }
}


// ************************************************************************* //
